---
kind: type
id: T:Autodesk.Revit.DB.FolderItemInfo
source: html/ef79812e-ea11-eda4-9c51-b54df57dc197.htm
---
# Autodesk.Revit.DB.FolderItemInfo

Contains data for each folder item in the organization settings of the project browser including folder parameter Id and folder name.

## Syntax (C#)
```csharp
public class FolderItemInfo : IDisposable
```

## Remarks
FolderItemInfo is the return value of BrowserOrganization.GetFolderItems().